8.10 Практическая работа (автотесты)


Задание 1
Цель
Научиться работать с циклами и, в частности, с операцией целочисленного деления.
Что нужно сделать
Представьте, что вы доставляете груз в ящиках одинакового размера. У вас есть грузовики и контейнеры. В каждый грузовик помещается максимум 12 контейнеров. В каждый контейнер — не более 27 ящиков. Ящики, контейнеры и грузовики пронумерованы.

Напишите программу, которая распределит ящики по контейнерам и грузовикам в зависимости от их количества.

Программа должна также выводить необходимое для этого число грузовиков и контейнеров исходя из количества ящиков, введённого пользователем после запуска программы.

Пример вывода программы для двух ящиков:

Грузовик: 1
    Контейнер: 1
        Ящик: 1
        Ящик: 2
 
Необходимо:
 
грузовиков - 1 шт.
контейнеров - 1 шт.

Советы и рекомендации
Для добавления отступа слева используйте символ табуляции \t.
Для переноса строк используйте строку, возвращаемую методом System.lineSeparator(). Этот метод возвращает системный перенос строки той операционной системы, на которой запущено приложение, так как в MacOS, Windows и Linux используются разные символы переноса строк: для Windows это \r\n, а для MacOS и Linux — \n.
Используйте для вычислений арифметическую операцию «остаток от деления»:
System.out.println(45 % 10); // вывод будет 5.



Задание 2
Цель
Научиться создавать объекты класса LocalDate, прибавлять к дате годы и сравнивать даты между собой.

Реализуйте метод:
public static String collectBirthdays(int year, int month, int day),

который вернёт строки, содержащие все ваши прошедшие дни рождения от момента рождения до текущей даты в требуемом формате. Дата рождения передаётся в метод тремя числами.

Формат требуемого вывода, если ваш день рождения — 31 декабря 1990 года, а сейчас — 1 апреля 2022 года:
0 - 31.12.1990 - Mon
1 - 31.12.1991 - Tue
2 - 31.12.1992 - Thu
3 - 31.12.1993 - Fri
.............
28 - 31.12.2018 - Mon
29 - 31.12.2019 - Tue
30 - 31.12.2020 - Thu
31 - 31.12.2021 - Fri

Советы и рекомендации
Создайте в начале метода две переменные класса LocalDate: birthday и today. После этого напишите цикл, в котором добавляйте один год к birthday и сравнивайте получившуюся дату с сегодняшней, используя метод isAfter или isBefore. Таким образом у вас будет проверяться не только год, но и день, что позволит точно выводить данные о прошедших днях рождениях.
Для переноса текста на новую строку используйте символ переноса строки, который возвращается методом System.lineSeparator():
String text = text + "Строка с датой" +